switch to plantuml for standard use case diagrams
